PeterVranken/TRK-USB-MPC5643L/LSM/printf/code/mai_main.c
/**
 * @file mai_main.c
 *   The main entry point of the C code. The startup code of the MCU is identical to sample
 * "startup"; refer to that sample for details.\n
 *   In this sample the main function applies the API of the startup code to install a
 * regular timer interrupt. The interrupt is used to let the LED on the evaluation board
 * blink as alive indication.\n
 *   This module includes the header \a f2d_float2Double.h and links file \a prf_printf.c
 * in order to provide full support of the stdout functionality of the C library. Function
 * main prints a greeting through RS 232 and USB to the host machine after it has completed
 * the hardware setup and once the interrupts are running. Then it enters an infinite loop,
 * which is used to regularly check the serial input buffer for newly received user input.
 * If a new line of input is available it is interpreted as user command. Different
 * responses are written to the serial output and different actions are taken depending on
 * the command. The actions are related to control of the blinking LED.\n
 *   The (virtual) RS 232 serial connection is implemented through the USB connection you
 * anyway have with the evaluation board. To run the sample you need to run a terminal
 * software on the host and open the connection to the board. The settings are 19200 Bd, 8
 * Bit, no parity, 1 start and stop bit. After reset of the evaluation board, begin with
 * typing help in the terminal program.
 *
 * Copyright (C) 2017 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   main
 * Local functions
 *   interruptPIT0Handler
 *   setD4Frequency
 *   setD4DutyCycle
 *   tokenizeCmdLine
 *   showW
 *   showC
 *   help
 *   version
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <math.h>
#include <float.h>
#include <limits.h>
#include <assert.h>

#include "MPC5643L.h"
#include "typ_types.h"
#include "sup_settings.h"
#include "ihw_initMcuCoreHW.h"
#include "lbd_ledAndButtonDriver.h"
#include "sio_serialIO.h"
#include "f2d_float2Double.h"
#include "mai_main.h"


/*
 * Defines
 */

/** Software version */
#define VERSION "0.10.4"

/*
 * Local type definitions
 */


/*
 * Local prototypes
 */


/*
 * Data definitions
 */

volatile unsigned long mai_cntIdle = 0    /** Counter of cycles of infinite main loop. */
                     , mai_cntIntPIT0 = 0;/** Counter of calls of PIT 0 interrupts */

/** The off-time of the period of the regularly blinking LED D4 in unit 2ms. */
static volatile signed int _ledD4_tiOffInMs = 250;

/** The on-time of the period of the regularly blinking LED D4 in unit 2ms. */
static volatile signed int _ledD4_tiOnInMs = 250;

/** The color currently used by the interrupt handler is controlled through selection of
    a pin. The selection is made by global variable. Here for D4. */
static volatile lbd_led_t _ledPIT0Handler = lbd_led_D4_red;


/*
 * Function implementation
 */

/**
 * Helper function: Read high resolution timer register of CPU. The register wraps around
 * after about 35s. The return value can be used to measure time spans up to this length.
 *   @return
 * Get the current register value. The value is incremented every 1/120MHz = (8+1/3)ns
 * regardless of the CPU activity.
 */
static inline uint32_t getTBL()
{
    uint32_t TBL;
    asm volatile ( /* AssemblerTemplate */
                   "mfspr %0, 268\n\r" /* SPR 268 = TBL, 269 = TBU */
                 : /* OutputOperands */ "=r" (TBL)
                 : /* InputOperands */
                 : /* Clobbers */
                 );
    return TBL;

} /* End of getTBL */


/**
 * Interrupt handler that serves the interrupt of Programmable Interrupt Timer 0.
 */
static void interruptPIT0Handler()
{
    ++ mai_cntIntPIT0;

    /* Acknowledge the interrupt in the causing HW device. */
    PIT.TFLG0.B.TIF = 0x1;

    /* Read the current button status to possibly toggle the LED colors. */
    static bool lastStateButton = false;
    if(lbd_getButton(lbd_bt_button_SW3))
    {
        if(!lastStateButton)
        {
            /* Button down event: Toggle colors */
            static unsigned int cntButtonPress_ = 0;

            lbd_setLED(_ledPIT0Handler, /* isOn */ false);
            _ledPIT0Handler = (cntButtonPress_ & 0x1) != 0? lbd_led_D4_red: lbd_led_D4_grn;

            lastStateButton = true;
            ++ cntButtonPress_;
        }
    }
    else
        lastStateButton = false;

    static int cntIsOn_ = 0;
    if(++cntIsOn_ >= _ledD4_tiOnInMs)
        cntIsOn_ = -_ledD4_tiOffInMs;
    lbd_setLED(_ledPIT0Handler, /* isOn */ cntIsOn_ >= 0);

} /* End of interruptPIT0Handler */



/**
 * Change frequency of blinking LED.
 *   @param strTiInMs
 * The desired frequency is specified by a string holding an integer that is interpreted as
 * wanted period time in ms.
 */
static void setD4Frequency(const char strTiInMs[])
{
    signed int i = atoi(strTiInMs);
    if(i == 0)
        i = 1000;
    else if(i < 10)
        i = 10;
    else if(i > 50000)
        i = 50000;

    /* The duty cycle is reset to 50%. */
    float dutyCycle = (float)_ledD4_tiOnInMs
                       / (float)(_ledD4_tiOnInMs + _ledD4_tiOffInMs);
    _ledD4_tiOnInMs = dutyCycle * (float)i;
    _ledD4_tiOffInMs = i - _ledD4_tiOnInMs;
    assert(_ledD4_tiOnInMs >= 0  &&  _ledD4_tiOffInMs >= 0);
    
} /* End of setD4Frequency */



/**
 * Change duty cyle of blinking LED.
 *   @param strDutyCycleInPercent
 * The desired duty cycle is specified by a string holding an integer that is interpreted as
 * as percent of on time in relation to period time.
 */
static void setD4DutyCycle(const char strDutyCycleInPercent[])
{
    signed int i = atoi(strDutyCycleInPercent);
    if(i < 0)
        i = 0;
    else if(i > 100)
        i = 100;

