PeterVranken/TRK-USB-MPC5643L/LSM/printf/code/mai_main.c
    /* Install the interrupt handler for cyclic timer PIT 0 (for test only) */
    ihw_installINTCInterruptHandler( interruptPIT0Handler
                                   , /* vectorNum */ 59
                                   , /* psrPriority */ 1
                                   , /* isPreemptable */ true
                                   );

    /* Enable timer operation and let them be stopped on debugger entry. */
    PIT.PITMCR.R = 0x1;

    /* Peripheral clock has been initialized to 120 MHz. To get a 1ms interrupt tick we
       need to count till 120000. */
    PIT.LDVAL0.R = 120000; /* Interrupt rate 1ms */

    /* Enable interrupts by this timer and start it. */
    PIT.TCTRL0.R  = 0x3;

    /* Initialize the button and LED driver for the eval board. */
    lbd_initLEDAndButtonDriver();

    /* Initialize the serial interface. */
    ldf_initSerialInterface(/* baudRate */ 19200);

    /* The external interrupts are enabled after configuring I/O devices and registering
       the interrupt handlers. */
    ihw_resumeAllInterrupts();

    char msg[512];
    snprintf( msg, sizeOfAry(msg)
            , "TRK-USB-MPC5643LAtGitHub - printf  Copyright (C) 2017  Peter Vranken\r\n"
              "This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\r\n"
              "This is free software, and you are welcome to redistribute it\r\n"
              "under certain conditions; type `show c' for details.\r\n"
            );
    fputs(msg, stdout);

    /* Sample code from readMe.adoc. */
    float x = 3.14;
    double y = expf(1.0);
    printf("%s=%.2f, %c=%.5g\r\n", "pi", f2d(x), 'e', f2d(y));

    /* System time. (We use floating point for the only reason of proving its correct
       operation. After about 2^24 times 10ms tiNextCycle will no longer increment and the
       software will fail.) All times in seconds. */
    const float tiCycleTime = 0.01f; /* s */
    float tiSys = 0.0f
        , tiNextCycle = tiSys + tiCycleTime;

    unsigned int cntIdleLoops = 0;
    while(true)
    {
        ++ mai_cntIdle;

        if(tiSys > tiNextCycle)
        {
            /* This assert should fire after about two days and halt the software. (Not
               proven.) */
            assert(tiNextCycle + tiCycleTime > tiNextCycle);
            tiNextCycle += tiCycleTime;

            /* Look for possible user input through serial interface. */
            char inputMsg[80+1];
            if(sio_getLine(inputMsg, sizeOfAry(inputMsg)) != NULL)
            {
                const char *argV[10];
                unsigned int argC = sizeOfAry(argV);
                tokenizeCmdLine(&argC, argV, inputMsg);
                if(argC >= 1)
                {
                    /* Echo user input. */
                    sio_writeSerial("You've typed: ", sizeof("You've typed: ")-1);
                    unsigned int u;
                    for(u=0; u<argC; ++u)
                    {
                        sio_writeSerial(argV[u], strlen(argV[u]));
                        sio_writeSerial(" ", 1);
                    }
                    sio_writeSerial("\r\n", 2);

                    /* Interpret the input as possible command. */
                    if(strcmp(argV[0], "green") == 0)
                    {
                        /* To avoid race conditions with the interrupt, we require a
                           critial section. */
                        /// @todo Double-check, is likely wrong, read-modify-write involved?
                        uint32_t msr = ihw_enterCriticalSection();
                        {
                            lbd_setLED(_ledPIT0Handler, /* isOn */ false);
                            _ledPIT0Handler = lbd_led_D4_grn;
                        }
                        ihw_leaveCriticalSection(msr);

                        /* Color followed by period time? Change frequency accordingly. */
                        if(argC >= 2)
                            setD4Frequency(argV[1]);

                        /* Period time followed by duty cyle? Change DC accordingly. */
                        if(argC >= 3)
                            setD4DutyCycle(argV[2]);
                    }
                    else if(strcmp(argV[0], "red") == 0)
                    {
                        uint32_t msr = ihw_enterCriticalSection();
                        {
                            lbd_setLED(_ledPIT0Handler, /* isOn */ false);
                            _ledPIT0Handler = lbd_led_D4_red;
                        }
                        ihw_leaveCriticalSection(msr);

                        /* Color followed by period time? Change frequency accordingly. */
                        if(argC >= 2)
                            setD4Frequency(argV[1]);

                        /* Period time followed by duty cyle? Change DC accordingly. */
                        if(argC >= 3)
                            setD4DutyCycle(argV[2]);
                    }
                    else if(strcmp(argV[0], "show") == 0)
                    {
                        if(argC >= 2)
                        {
                            if(strcmp(argV[1], "c") == 0)
                                showC();
                            else if(strcmp(argV[1], "w") == 0)
                                showW();
                        }
                    }
                    else if(strcmp(argV[0], "help") == 0)
                        help();
                    else if(strcmp(argV[0], "version") == 0)
                        version();
                    else if(strcmp(argV[0], "time") == 0)
                    {
                        /* Tip: Consider using anywhere in your application the integer
                           variants of printf from the new C library and do not link the
                           floating point standard implementation. This will save ROM space and
                           a lot of CPU load. */
                        unsigned int h, m, s, ms;
                        h = mai_cntIntPIT0 / 3600000;
                        m = s = mai_cntIntPIT0 - h*3600000;
                        m /= 60000;
                        s = ms = s - m*60000;
                        s /= 1000;
                        ms = ms - s*1000;

                        iprintf( "%s: time=%u:%02u:%02u:%03u\r\n"
                               , __func__
                               , h, m, s, ms
                               );
                    }
                    else if(strcmp(argV[0], "timing") == 0)
                    {
                        static unsigned int cnt_ = 0;
                        uint32_t tiStart = getTBL();

                        puts("Hello World, this is puts\r\n");
                        fputs("Hello World, this is fputs(stdout)\r\n", stdout);
                        fputs("Hello World, this is fputs(stderr)\r\n", stderr);
                        fprintf(stdout, "Hello World, this is fprintf(%s)\r\n", "stdout");
                        fprintf(stderr, "Hello World, this is fprintf(%s)\r\n", "stderr");
                        putchar('x'); putchar('y'); putchar('z'); putchar('\r'); putchar('\n');

                        /* Elapsed time for all output so far, basically measured in 8.33=25/3 ns
                           units. */
                        uint32_t tiPrintNs = 25*(getTBL() - tiStart)/3
                               , tiPrintUs = tiPrintNs / 1000;
                        tiPrintNs -= tiPrintUs * 1000;
                        fiprintf( stdout, "Time to print all the greetings: %u.%03u us\r\n"
                                , tiPrintUs, tiPrintNs
                                );

                        tiStart = getTBL();
                        printf( "%s: cnt_=%i, time=%.3f min=%.3f h\r\n"
                              , "Floating point"
                              , cnt_
                              , f2d(mai_cntIntPIT0/60.0e3)
                              , f2d(mai_cntIntPIT0/3600.0e3)
                              );
                        tiPrintNs = 25*(getTBL() - tiStart)/3;
                        tiPrintUs = tiPrintNs / 1000;
                        fiprintf( stdout, "Time to print previous line: %u.%03u us\r\n"
                                , tiPrintUs, tiPrintNs
                                );

                        ++ cnt_;

